app/views/blogs/index.html.erb

                <br />
                <% blog.novines.order('created_at DESC').each do |novine| %>
---
SELECT "novines".* FROM "novines" INNER JOIN "bloggables" ON "novines"."id" = "bloggables"."novine_id" WHERE "bloggables"."blog_id" = 1 ORDER BY created_at DESC