app/views/blogs/show.html.erb

    <div>
      <% @blog.novines.each do |a| %>
---
SELECT "novines".* FROM "novines" INNER JOIN "bloggables" ON "novines"."id" = "bloggables"."novine_id" WHERE "bloggables"."blog_id" = 1