app/views/novines/index.html.erb

        <strong class="block font-medium mb-1">
        <% novine.blogs.each do |blog| %>
---
SELECT "blogs".* FROM "blogs" INNER JOIN "bloggables" ON "blogs"."id" = "bloggables"."blog_id" WHERE "bloggables"."novine_id" = 13