app/views/arts/index.html.erb

              <ul class="1vertical-menu">
            <% art.lists.order('created_at DESC').each do |list| %>
---
SELECT "lists".* FROM "lists" WHERE "lists"."art_id" = 16 ORDER BY created_at DESC