app/views/arts/show.html.erb

    <div>
      <% @art.lists.each do |n| %>
---
SELECT "lists".* FROM "lists" WHERE "lists"."art_id" = 3