app/controllers/novines_controller.rb

  def index
    #@novines = Novine.all
    @novines = Novine.all.order('created_at DESC')
---
SELECT "novines".* FROM "novines" ORDER BY created_at DESC LIMIT 1 OFFSET 0

  def update
    respond_to do |format|
      if @novine.update(novine_params)
---
UPDATE "novines" SET "updated_at" = '2026-04-29 10:54:39.410451' WHERE "novines"."id" = 13

    def set_novine
      @novine = Novine.find(params.expect(:id))
---
SELECT "novines".* FROM "novines" WHERE "novines"."id" = 13 LIMIT 1

    def current_user
      User.first
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT 1